artillery-config.yml
# Artillery load test configuration for Sovren API
# Run with: npm run test:load
# Requires: npm install -g artillery
#
# Targets the staging environment by default.
# Override target with: artillery run artillery-config.yml --target https://custom-host

config:
  target: "https://api-staging.sovren.dev"
  phases:
    - name: "Warm-up"
      duration: 30
      arrivalRate: 2
    - name: "Ramp up"
      duration: 60
      arrivalRate: 2
      rampTo: 20
    - name: "Sustained load"
      duration: 120
      arrivalRate: 20
    - name: "Ramp down"
      duration: 30
      arrivalRate: 20
      rampTo: 2
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
  # Treat 4xx as non-errors (expected for unauthenticated requests)
  http:
    timeout: 10

scenarios:
  - name: "Health check"
    weight: 3
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode:
                - 200
                - 503  # Degraded but alive

  - name: "Content listing"
    weight: 5
    flow:
      - get:
          url: "/api/v1/content"
          expect:
            - statusCode:
                - 200
                - 401  # Unauthenticated — expected without a token

  - name: "Create Lightning invoice"
    weight: 2
    flow:
      - post:
          url: "/api/v1/payments/invoices"
          json:
            amount_sats: 1000
            memo: "load-test-invoice"
          expect:
            - statusCode:
                - 200
                - 201
                - 400  # Validation error — acceptable in load test
                - 401  # Unauthenticated — expected without a token
                - 422  # Unprocessable entity — acceptable in load test